# Exercise 5: Repeat the computation from the facts & dimension table

In [1]:
# Load ipython-sql
%load_ext sql

# Setup database connection
# Define parameters
DB_ENDPOINT = 'localhost'
DB_NAME = 'pagila'
DB_USER = 'postgres'
DB_PASSWORD = 'postgres'
DB_PORT = '5432'

conn_string = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_ENDPOINT}:{DB_PORT}/{DB_NAME}"

# Connect
%sql $conn_string

## Facts table

In [2]:
%%time
%%sql
SELECT movie_key, date_key, customer_key, sales_amount
FROM factSales 
limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.
Wall time: 6.77 ms

[(870, 20200124, 269, Decimal('1.99')),
 (651, 20200125, 269, Decimal('0.99')),
 (818, 20200128, 269, Decimal('6.99')),
 (249, 20200129, 269, Decimal('0.99')),
 (159, 20200129, 269, Decimal('4.99'))]

## Join fact table with dimensions 

##### Star Schema

In [22]:
%%time
%%sql
SELECT dimMovie.title, dimDate.month, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales 
JOIN dimMovie    ON dimMovie.movie_key = factSales.movie_key
JOIN dimDate     ON dimDate.date_key = factSales.date_key
JOIN dimCustomer ON dimCustomer.customer_key = factSales.customer_key
GROUP BY dimMovie.title, dimDate.month, dimCustomer.city
ORDER BY dimMovie.title, dimDate.month, dimCustomer.city, revenue DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.
Wall time: 92.6 ms

[('ACADEMY DINOSAUR', 1, 'Celaya', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 1, 'Cianjur', Decimal('1.99')),
 ('ACADEMY DINOSAUR', 2, 'San Lorenzo', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 2, 'Sullana', Decimal('1.99')),
 ('ACADEMY DINOSAUR', 2, 'Udaipur', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 3, 'Almirante Brown', Decimal('1.99')),
 ('ACADEMY DINOSAUR', 3, 'Goinia', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 3, 'Kaliningrad', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 3, 'Kurashiki', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 3, 'Livorno', Decimal('0.99'))]

##### 3NF Schema

In [23]:
%%time
%%sql
SELECT f.title, EXTRACT(month FROM p.payment_date) as month, ci.city, sum(p.amount) as revenue
FROM payment p
JOIN rental r    ON p.rental_id = r.rental_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f      ON i.film_id = f.film_id
JOIN customer c  ON p.customer_id = c.customer_id
JOIN address a   ON c.address_id = a.address_id
JOIN city ci     ON a.city_id = ci.city_id
GROUP BY f.title, month, ci.city
ORDER BY f.title, month, ci.city, revenue desc
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.
Wall time: 110 ms

[('ACADEMY DINOSAUR', Decimal('1'), 'Celaya', Decimal('0.99')),
 ('ACADEMY DINOSAUR', Decimal('1'), 'Cianjur', Decimal('1.99')),
 ('ACADEMY DINOSAUR', Decimal('2'), 'San Lorenzo', Decimal('0.99')),
 ('ACADEMY DINOSAUR', Decimal('2'), 'Sullana', Decimal('1.99')),
 ('ACADEMY DINOSAUR', Decimal('2'), 'Udaipur', Decimal('0.99')),
 ('ACADEMY DINOSAUR', Decimal('3'), 'Almirante Brown', Decimal('1.99')),
 ('ACADEMY DINOSAUR', Decimal('3'), 'Goinia', Decimal('0.99')),
 ('ACADEMY DINOSAUR', Decimal('3'), 'Kaliningrad', Decimal('0.99')),
 ('ACADEMY DINOSAUR', Decimal('3'), 'Kurashiki', Decimal('0.99')),
 ('ACADEMY DINOSAUR', Decimal('3'), 'Livorno', Decimal('0.99'))]

# Conclusion

We were able to show that:
* The star schema is easier to understand and write queries against.
* Queries with a star schema are more performant.